{
  "_id": "682dc42004486e909646cbeb",
  "title": "Chinese Laundry Blues",
  "artist": "George Formby",
  "lyrics": "(D7) Now Mr. (G) Wu was a (Eb7) laundry man\nIn a (G) shop with an (D7) old green (G) door\nHe’d (D7) iron all day your (G) linen away\nHe (A7) really makes me (D7) sore\nHe’s (Am) lost his (D7) heart to a (Am) Chinese (D7) girl\nAnd his (G) laundry’s all (Cm) gone (G) wrong\nAll (A7) day he’ll flirt and scorch your shirt\nThat’s why I’m singing this (D7) song\n \n(D7) Oh Mr. (G) Wu, what can I (E7) do,\nI'm feeling (A7) kind of Limehouse\n(Eb7) Chinese (D7) laundry (G) blues (G7)\nThis funny (C) feeling, keeps (Cm) round me (G) stealing (E7)\nOh (A7) wont you throw your sweat-heart over (D) do (Bm) (D7)\nMy vests so (G) short that it wont fit (G7) my little brother\nAnd my (C) new Sunday shirt has got a (Eb7) perforated rudder\nMr. (G) Wu (B7) what shall I (E7) do, I’m feeling (A7) kind of Limehouse\n(Eb7) Chinese (D7) laundry (G) blues\n \n(D7) Now Mr. (G) Wu, he’s got a (G7) naughty eye that flickers\nYou (C) ought to see it wobble\nWhen he’s (Eb7) ironing ladies blouses!\nMr. (G) Wu (B7) what shall I (E7) do, I’m feeling (A7) kind of Limehouse\n(Eb7) Chinese (D7) laundry (G) blues\n(D7) Now Mr. (G) Wu he’s got a (G7) laundry kind of tricky\nHell (C) starch my shirt and collars\nBut he’ll (Eb7) never touch my waistcoat!\nMr. (G) Wu (B7) what shall I (E7) do, I’m feeling (A7) kind of Limehouse\n(Eb7) Chinese (D7) laundry (G) blues\n \n(D7) Oh Mr. (G) Wu, what can I (E7) do, I’m feeling (A7) kind of Limehouse\n(Eb7) Chinese (D7) laundry (G) blues (G7)\nThis funny (C) feeling, keeps (Cm) round me (G) stealing (E7)\nOh (A7) wont you throw your sweat-heart over (D) do (Bm) (D7)\nMy vests so (G) short that it wont fit (G7) my little brother\nAnd my (C) new Sunday shirt has got a (Eb7) perforated rudder\n \nMr. (G) Wu (B7) what shall I (E7) do, I’m feeling (A7) kind of Limehouse\n(Eb7) Chinese (D7) laundry (G) blues [end]",
  "chords": [
    "A7",
    "Am",
    "B7",
    "Bm",
    "C",
    "Cm",
    "D7",
    "E7",
    "Eb7",
    "G",
    "G7"
  ]
}