{
  "_id": "682dc45404486e909646cd63",
  "title": "Should I Stay Or Should I Go",
  "artist": "The Clash",
  "lyrics": "(D-D-D-G-G-G-G-D)\nDarling you got to let me know (D-D-D-G-G-G-G-D)\nShould I stay or should I go? (D-D-D-G-G-G-G-D)\nIf you say that you are mine (G-G-G-F-F-F-F-G)\nI'll be here till the end of time (D-D-D-G-G-G-G-D)\nSo you got to let me know (A-A-A-A-A7-A7-A7-A7)\nShould I stay or should I go? (D-D-D-G-G-G-G-D)\n \nIt's always tease tease tease (D-D-D-G-G-G-G-D)\nYou're happy when I'm on my knees (D-D-D-G-G-G-G-D)\nOne day is fine, and next is black (G-G-G-F-F-F-F-G)\nSo if you want me off your back (D-D-D-G-G-G-G-D)\nWell come on and let me know (A-A-A-A-A7-A7-A7-A7)\nShould I Stay or should I go? (D-D-D-G-G-G-G-D)\n \nShould I stay or should I go now? [fast] (D-D-D-G-G-G-G-D)\nShould I stay or should I go now? (D-D-D-G-G-G-G-D)\nIf I go there will be trouble (G-G-G-F-F-F-F-G)\nAnd if I stay it will be double (D-D-D-G-G-G-G-D)\nSo come on and let me know (A-A-A-A-A7-A7-A7-A7)\n \n[stop, then normal speed]\nShould I stay or should I go (D-D-D-G-G-G-G-D)\nThis indecision's bugging me (D-D-D-G-G-G-G-D)\n                  (Esta indecision me molesta)\nIf you don't want me, set me free (D-D-D-G-G-G-G-D)\n                  (Si no me quieres, librame)\nExactly whom I'm supposed to be (G-G-G-F-F-F-F-G)\n                  (Digame quien tengo ser)\nDon't you know which clothes even fit me? (D-D-D-G-G-G-G-D)\n                  (Sabes que ropas me queda?)\nCome on and let me know (A-A-A-A-A7-A7-A7-A7)\n                  (Me tienes que decir)\nShould I cool it or should I blow? (D-D-D-G-G-G-G-D)\n                  (Me debo ir o quedarme?)\n \nShould I stay or should I go now? [fast] (D-D-D-G-G-G-G-D)\nShould I stay or should I go now? (D-D-D-G-G-G-G-D)\nIf I go there will be trouble (G-G-G-F-F-F-F-G)\nAnd if I stay it will be double (D-D-D-G-G-G-G-D)\nSo come on and let me know (A-A-A-A-A7-A7-A7-A7)\n[stop, then normal speed]\nShould I stay or should I go (D-D-D-G-G-G-G-D)\n[end]",
  "chords": [
    "A",
    "Bb",
    "C",
    "D",
    "G"
  ]
}